# Mandatory cross-profile Core Shell Stack CLI tools.

brew "bat"
brew "btop"
brew "chezmoi"
brew "dust"
brew "duf"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gum"
brew "lazygit"
brew "lsd"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "zellij"
brew "zoxide"
